docs/posts/2026-06-06-coincidence.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Jun 06, 2026 11:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Coincidence?</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/posts/rss.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<h1 class="title">Coincidence?
<br />
<span class="subtitle">Jun 06, 2026 11:35</span>
</h1>
<p>
My mother-in-law died yesterday after a long period of decline. She had been admitted to hospital for breathing issues a few days ago. On the wall opposite her hospital bed was a broken clock that was stopped at 8:04. She complained about the clock to every visitor and every hospital employee that entered the room.
</p>

<p>
After a family decision to start her on end-of-life comfort care, the nurse removed her oxygen mask and started administering morphine intravenously. Her oxygen level and pulse rate  quickly dropped. As the end grew near, the nurse came in to note the time of death. She would look at the machines and her watch, and said in disbelief, &ldquo;She&rsquo;s waiting for right minute.&rdquo; Finally, she marked the time of death at <i>8:04</i>.
</p>

<div class="tagline" id="orgbe31658">
<p>
Tagged:  <a href="../tags/family.html">Family</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2026 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jun 06, 2026 11:44.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 31.0.60 (<a href="https://orgmode.org">Org</a> mode 9.8.3).
</div>
</footer>
</body>
</html>
